Repository: trafo2/t2_captcha
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# missing-typoscript
source: Could not found any typoscript definition for t2_captcha.
de: Es wurde keine TypoScript-Definition für t2_captcha gefunden.

# curl-error
source: An error occurred while accessing CAPTCHA verification service: %s
de: Bei Aufruf des CAPTCHA-Dienstes ist ein Fehler aufgetreten: %s

# empty-response
source: The response of the CAPTCHA verification service was empty.
de: Die Antwort des CAPTCHA-Dienstes war leer.

# invalid-json
source: The response of the CAPTCHA verification service did not contain valid JSON.
de: Die Antwort des CAPTCHA-Dienstes enthielt kein gültiges JSON.

# missing-private-key
source: No private key provided. Please specify a private key in the typoscript definition.
de: Es wurde kein privater Schlüssel angegeben.

# missing-response
source: Please verify as human by clicking the CAPTCHA.
de: Bitte verifizieren Sie sich als Mensch, indem Sie die CAPTCHA-Prüfung durchführen.

# missing-input-secret
source: The secret key is missing.
de: Es wurde kein privater Schlüssel angegeben.

# invalid-input-secret
source: The secret key is invalid or malformed.
de: Der private Schlüssel ist ungültig.

# missing-input-response
source: The response parameter (verification token) is missing.
de: Bitte verifizieren Sie sich als Mensch, indem Sie die CAPTCHA-Prüfung durchführen.

# invalid-input-response
source: The response parameter (verification token) is invalid or malformed.
de: Bitte verifizieren Sie sich als Mensch, indem Sie die CAPTCHA-Prüfung durchführen.

# bad-request
source: The request is invalid or malformed.
de: Der Request ist ungültig.

# invalid-or-already-seen-response
source: The response parameter has already been checked, or has another issue.
de: Die CAPTCHA-Überprüfung ist fehlgeschlagen. Bitte versuchen Sie es erneut.

# timeout-or-duplicate
source: The response is no longer valid: either is too old or has been used previously.
de: Die CAPTCHA-Überprüfung ist abgelaufen. Bitte versuchen Sie es erneut.
